import { Review } from "../components/review/review.type";

const Reviews: Review[] = [
  {
    "id": "cc6f9f31-87c2-4c18-910c-7f628d3b5008",
    "userName": "Кирилл",
    "advantage": "Настройки, внешний вид, лёгкость",
    "disadvantage": "Без объектива",
    "review": "Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.",
    "rating": 4,
    "createAt": "2024-07-12T09:25:26.578Z",
    "cameraId": 1
  },
  {
    "id": "6205377c-9dac-45d1-a5ee-ed9203348d40",
    "userName": "Кирилл",
    "advantage": "Хорошо. Отличная камера.",
    "disadvantage": "Пришла поврежденная упаковка. Нет теперь понимая со внутренностями",
    "review": "Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.",
    "rating": 4,
    "createAt": "2025-01-06T09:25:26.611Z",
    "cameraId": 1
  },
  {
    "id": "50c8811c-bcc8-46d9-ac88-d58bf145c06d",
    "userName": "Евгений",
    "advantage": "Хорошо. Отличная камера.",
    "disadvantage": "Плохая камера, не рекомендую",
    "review": "Отличная камера, мне понравилась, пользуюсь около года. Профессионально оценить нет возможности. Есть разные мелкие недочеты, но, по скольку я не являюсь специалисто в данной области, они не ощущаются в моих работах.",
    "rating": 2,
    "createAt": "2024-12-09T09:25:26.611Z",
    "cameraId": 1
  },
  {
    "id": "bc97d0f8-4612-4aae-a7b2-3d6faea2e837",
    "userName": "Кирилл",
    "advantage": "Смущает цена",
    "disadvantage": "Трудно найти чехол. Заводские крайне дррогие",
    "review": "Отличная камера, мне понравилась, пользуюсь около года. Профессионально оценить нет возможности. Есть разные мелкие недочеты, но, по скольку я не являюсь специалисто в данной области, они не ощущаются в моих работах.",
    "rating": 5,
    "createAt": "2024-12-07T09:25:26.611Z",
    "cameraId": 1
  },
  {
    "id": "67271030-fb2b-4729-b761-f12b6148595e",
    "cameraId": 1,
    "userName": "Napruz",
    "advantage": "kefke ",
    "disadvantage": "eflmfe",
    "review": "efl;efl ",
    "rating": 3,
    "createAt": "2025-03-13T19:30:10.172Z"
  },
  {
    "id": "1a2c6216-188a-46c4-8974-cc09c148177a",
    "cameraId": 1,
    "userName": "Сергей",
    "advantage": "Отличная камера",
    "disadvantage": "цена",
    "review": "берите скорее",
    "rating": 5,
    "createAt": "2025-03-13T19:30:47.017Z"
  },
  {
    "id": "c5635f1f-8a53-4c36-bb6f-9c3fe83b1e5c",
    "cameraId": 1,
    "userName": "Кирилл",
    "advantage": "Легкая в плане веса, удобная в интерфейсе",
    "disadvantage": "Быстро садиться зарядка",
    "review": "Это моя первая камера. Я в восторге, нареканий нет",
    "rating": 5,
    "createAt": "2025-05-21T03:23:06.776Z"
  },
  {
    "id": "271b5554-9aed-4ab0-bd3b-8cd81c141812",
    "userName": "Ксения",
    "advantage": "Покупали недавно. Пока нареканий нет.",
    "disadvantage": "Быстро садиться зарядка",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 1,
    "createAt": "2024-08-02T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "9c4e84d4-4ac8-401b-bf90-4ec92de49f29",
    "userName": "Ольга",
    "advantage": "Хорошо. Отличная камера.",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "В целом для домашнего использования в самый раз!",
    "rating": 4,
    "createAt": "2024-12-08T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "8889c78b-6c61-44b8-a929-6e6e8f506667",
    "userName": "Никита",
    "advantage": "Настройки, внешний вид, лёгкость",
    "disadvantage": "Быстро садиться зарядка",
    "review": "Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать",
    "rating": 1,
    "createAt": "2024-10-30T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "2acc2d9c-ea09-482e-9e63-d77518e90c85",
    "userName": "Евгений",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Без объектива",
    "review": "Камера достаточно хорошая, но не очень радует цена.",
    "rating": 1,
    "createAt": "2024-10-01T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "8ba55560-8594-4ee2-87a8-ba0ef4d72708",
    "userName": "Артём",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.",
    "rating": 1,
    "createAt": "2025-01-12T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "32e04b92-39af-47d5-bc72-2db15065a6d5",
    "userName": "Никита",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать",
    "rating": 5,
    "createAt": "2024-11-08T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "52c4d455-06cc-4e5c-8c4c-b6dc911e5d3a",
    "userName": "Артём",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Пришла поврежденная упаковка. Нет теперь понимая со внутренностями",
    "review": "В целом для домашнего использования в самый раз!",
    "rating": 1,
    "createAt": "2024-11-29T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "2e5a76b2-a1a7-4e02-9541-c7a69b8dedba",
    "userName": "Артём",
    "advantage": "Хороший стабилизатор и матрица",
    "disadvantage": "Трудно найти чехол. Заводские крайне дррогие",
    "review": "Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.",
    "rating": 1,
    "createAt": "2024-10-03T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "98af6b68-34db-4f73-898a-34f7ee006ce6",
    "userName": "Анастасия",
    "advantage": "Нет.",
    "disadvantage": "Нет.",
    "review": "Камера достаточно хорошая, но не очень радует цена.",
    "rating": 3,
    "createAt": "2024-08-10T09:25:26.611Z",
    "cameraId": 2
  },
  {
    "id": "706e6e2f-0a9f-4d04-9e57-444c3d6da021",
    "userName": "12313",
    "advantage": "1234dfadfasdfasdf",
    "disadvantage": "asdfasdfsadfasdf",
    "review": "adfasdfdsf",
    "rating": 4,
    "cameraId": 2,
    "createAt": "2025-01-17T13:55:34.097Z"
  },
  {
    "id": "347ce5f3-28df-4b81-856d-2103caed1ac4",
    "cameraId": 2,
    "userName": "Хомяк-молчун",
    "advantage": "Молчит хомяк",
    "disadvantage": "Молчит хомяк",
    "review": "Молчит хомяк, дальше идёт",
    "rating": 5,
    "createAt": "2025-05-17T12:30:23.524Z"
  },
  {
    "id": "f73c00df-18f3-427d-a3d1-480408b57296",
    "userName": "Ксения",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Не рекомендую!",
    "review": "Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать",
    "rating": 3,
    "createAt": "2024-07-03T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "e04dc7de-b3a9-43e6-9bfe-21c29c453304",
    "userName": "Евгений",
    "advantage": "Настройки, внешний вид, лёгкость",
    "disadvantage": "Нет.",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 3,
    "createAt": "2024-06-29T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "43901704-88b1-453f-9c55-ba9f1bdfc0be",
    "userName": "Дарья",
    "advantage": "Цена соответствует качеству.",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 1,
    "createAt": "2024-11-08T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "1738d80e-b52d-4e6c-b4d4-46c30eacffbf",
    "userName": "Алексей",
    "advantage": "Цена соответствует качеству.",
    "disadvantage": "Не удобный интерфейс и кнопки",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 4,
    "createAt": "2024-07-31T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "bee80b20-8283-45eb-a4ac-6027daa38ed0",
    "userName": "Павел",
    "advantage": "Нет.",
    "disadvantage": "Нет.",
    "review": "Отличная камера, мне понравилась, пользуюсь около года. Профессионально оценить нет возможности. Есть разные мелкие недочеты, но, по скольку я не являюсь специалисто в данной области, они не ощущаются в моих работах.",
    "rating": 2,
    "createAt": "2024-09-13T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "0d1fbc4b-8955-40bf-aaab-1c60a6cf1024",
    "userName": "Алексей",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Без объектива",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 2,
    "createAt": "2024-10-31T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "4ba93c28-b2ba-42b2-8d3d-4f306586bc4e",
    "userName": "Анастасия",
    "advantage": "Покупали недавно. Пока нареканий нет.",
    "disadvantage": "Не рекомендую!",
    "review": "В целом для домашнего использования в самый раз!",
    "rating": 4,
    "createAt": "2024-08-06T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "003e5e8a-06f9-41fb-ad9e-fb8b2938fd1a",
    "userName": "Кирилл",
    "advantage": "Хороший стабилизатор и матрица",
    "disadvantage": "Плохая камера, не рекомендую",
    "review": "Камера достаточно хорошая, но не очень радует цена.",
    "rating": 2,
    "createAt": "2024-11-11T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "aecd63c1-2c35-46f9-8184-bee653969a78",
    "userName": "Кирилл",
    "advantage": "Хорошо. Отличная камера.",
    "disadvantage": "Плохая камера, не рекомендую",
    "review": "Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать",
    "rating": 5,
    "createAt": "2024-07-01T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "dccadfa7-af1c-4c45-aed5-3d188b416f8c",
    "userName": "Павел",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Быстро садиться зарядка",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 1,
    "createAt": "2025-01-02T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "6432e5c9-1f9b-4896-a3dc-96c0aeb304c6",
    "userName": "Евгений",
    "advantage": "Легкая в плане веса, удобная в интерфейсе, зарядка",
    "disadvantage": "Странные звуки при переключении режимов",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 4,
    "createAt": "2024-08-30T09:25:26.611Z",
    "cameraId": 3
  },
  {
    "id": "34ffb7a6-298f-4999-bb7b-b3a61b544fef",
    "userName": "Дарья",
    "advantage": "Нет.",
    "disadvantage": "Не удобный интерфейс и кнопки",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 3,
    "createAt": "2024-09-01T09:25:26.611Z",
    "cameraId": 4
  },
  {
    "id": "88672059-4da3-4039-b354-9e04468b17e3",
    "userName": "Алексей",
    "advantage": "Покупали недавно. Пока нареканий нет.",
    "disadvantage": "Не удобный интерфейс и кнопки",
    "review": "Хорошая камера. Лучше за эти деньги не найти.",
    "rating": 1,
    "createAt": "2024-10-12T09:25:26.611Z",
    "cameraId": 4
  },
  {
    "id": "ed6c88fc-692d-4cd2-bb2e-7f1f73ffe87c",
    "userName": "Артём",
    "advantage": "Легкая в плане веса, удобная в интерфейсе, зарядка",
    "disadvantage": "Не удобный интерфейс и кнопки",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 4,
    "createAt": "2024-10-30T09:25:26.611Z",
    "cameraId": 4
  },
  {
    "id": "36cc6a09-8092-46be-9ffb-1883c110b2ce",
    "userName": "Павел",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 5,
    "createAt": "2025-01-12T09:25:26.611Z",
    "cameraId": 5
  },
  {
    "id": "66b10ef7-9c80-4e76-a82b-66b595b04cc0",
    "userName": "Никита",
    "advantage": "Покупали недавно. Пока нареканий нет.",
    "disadvantage": "Быстро садиться зарядка",
    "review": "Отличная камера, мне понравилась, пользуюсь около года. Профессионально оценить нет возможности. Есть разные мелкие недочеты, но, по скольку я не являюсь специалисто в данной области, они не ощущаются в моих работах.",
    "rating": 3,
    "createAt": "2024-12-05T09:25:26.611Z",
    "cameraId": 5
  },
  {
    "id": "53d10d34-1061-447b-a024-6da945571663",
    "userName": "Дарья",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "Хорошая камера. Лучше за эти деньги не найти.",
    "rating": 1,
    "createAt": "2024-08-10T09:25:26.611Z",
    "cameraId": 6
  },
  {
    "id": "703bf32f-fdb4-45f6-87fd-df763e47a74d",
    "userName": "Кирилл",
    "advantage": "Настройки, внешний вид, лёгкость",
    "disadvantage": "Пришла поврежденная упаковка. Нет теперь понимая со внутренностями",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 1,
    "createAt": "2024-08-31T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "568ab8f7-3b14-4443-8544-0988369300a1",
    "userName": "Павел",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Плохая камера, не рекомендую",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 2,
    "createAt": "2025-01-08T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "c56e0fbe-95d0-4348-844a-fe1e43bc8506",
    "userName": "Кирилл",
    "advantage": "Недорогая, за такую цену отличный вариант.",
    "disadvantage": "Нет.",
    "review": "Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать",
    "rating": 2,
    "createAt": "2024-09-11T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "3a7aeb10-b14d-464b-ab58-4b709dc8fe60",
    "userName": "Александр",
    "advantage": "Хорошо. Отличная камера.",
    "disadvantage": "Пришла поврежденная упаковка. Нет теперь понимая со внутренностями",
    "review": "Камера достаточно хорошая, но не очень радует цена.",
    "rating": 5,
    "createAt": "2024-09-13T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "5a1cd456-7253-4de9-a36a-1e475cadec9e",
    "userName": "Александр",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Не рекомендую!",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 3,
    "createAt": "2024-09-14T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "752bfbdf-3b8f-4aa5-82f5-bc1a6a3a4fc0",
    "userName": "Ксения",
    "advantage": "Хороший стабилизатор и матрица",
    "disadvantage": "Плохая камера, не рекомендую",
    "review": "Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.",
    "rating": 4,
    "createAt": "2025-01-08T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "862b9559-e255-4b43-9643-a48a1b4e1d1f",
    "userName": "Никита",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Трудно найти чехол. Заводские крайне дррогие",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 3,
    "createAt": "2024-11-08T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "99f05344-7417-4947-a9e0-dfd33aa58838",
    "userName": "Ольга",
    "advantage": "Нет.",
    "disadvantage": "Пришла поврежденная упаковка. Нет теперь понимая со внутренностями",
    "review": "Хорошая камера. Лучше за эти деньги не найти.",
    "rating": 5,
    "createAt": "2024-07-05T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "9d2cdaf2-78e3-438d-8c2c-771c0e26523e",
    "userName": "Анастасия",
    "advantage": "Легкая в плане веса, удобная в интерфейсе, зарядка",
    "disadvantage": "Не удобный интерфейс и кнопки",
    "review": "Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания",
    "rating": 3,
    "createAt": "2024-11-01T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "c519e952-00c6-4494-9a69-3de41cd99b3c",
    "userName": "Артём",
    "advantage": "Хороший стабилизатор и матрица",
    "disadvantage": "Не рекомендую!",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 3,
    "createAt": "2024-10-08T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "49ca568a-7029-4ffe-ae74-f0ad8f0fc5e9",
    "userName": "Евгений",
    "advantage": "Легкая в плане веса, удобная в интерфейсе, зарядка",
    "disadvantage": "Странные звуки при переключении режимов",
    "review": "В целом для домашнего использования в самый раз!",
    "rating": 3,
    "createAt": "2024-09-09T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "070a47c0-e940-4f77-980f-cebf1b62f47f",
    "userName": "Кирилл",
    "advantage": "Рекомендую данный аппарат",
    "disadvantage": "Странные звуки при переключении режимов",
    "review": "Камера достаточно хорошая, но не очень радует цена.",
    "rating": 2,
    "createAt": "2025-01-01T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "4cb47c49-5736-440a-b0dd-d17bb4324a0d",
    "userName": "Дарья",
    "advantage": "Хорошо. Отличная камера.",
    "disadvantage": "Не рекомендую!",
    "review": "Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать",
    "rating": 2,
    "createAt": "2024-12-02T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "3b09eae1-320a-4f05-ab65-ba6275334079",
    "userName": "Дарья",
    "advantage": "Смущает цена",
    "disadvantage": "Трудно найти чехол. Заводские крайне дррогие",
    "review": "Не возможно найти дополнительные аккамуляторы. К сожалению, те, что идут в комплекте не держут более 7 часов?",
    "rating": 1,
    "createAt": "2024-08-31T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "c4a80e74-9da8-475e-bb90-aa03dc98fad3",
    "userName": "Алексей",
    "advantage": "Цена соответствует качеству.",
    "disadvantage": "Пришла поврежденная упаковка. Нет теперь понимая со внутренностями",
    "review": "Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.",
    "rating": 4,
    "createAt": "2024-10-03T09:25:26.612Z",
    "cameraId": 7
  },
  {
    "id": "21b1c449-d4f5-4a6e-b8ce-c33417f1bd48",
    "userName": "Ксения",
    "advantage": "Покупали недавно. Пока нареканий нет.",
    "disadvantage": "Тяжелая. Рука быстро устаёт",
    "review": "Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость",
    "rating": 4,
    "createAt": "2024-10-07T09:25:26.612Z",
    "cameraId": 7
  },
];

export const getReviewsById = (id: number): Review[] => Reviews.filter((review) => review.cameraId === id);
